benchmark/out/grpc_rps_500_n_2.txt

Summary:
  Count:	166
  Total:	10.00 s
  Slowest:	731.56 ms
  Fastest:	425.56 ms
  Average:	599.74 ms
  Requests/sec:	16.60

Response time histogram:
  425.561 [1]  |∎
  456.161 [1]  |∎
  486.760 [0]  |
  517.360 [3]  |∎∎∎
  547.960 [3]  |∎∎∎
  578.560 [18] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  609.160 [46] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  639.759 [41] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  670.359 [32] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  700.959 [6]  |∎∎∎∎∎
  731.559 [5]  |∎∎∎∎

Latency distribution:
  10 % in 571.76 ms 
  25 % in 585.32 ms 
  50 % in 612.14 ms 
  75 % in 643.80 ms 
  90 % in 667.63 ms 
  95 % in 677.26 ms 
  99 % in 725.50 ms 

Status code distribution:
  [OK]            156 responses   
  [Unavailable]   10 responses    

Error distribution:
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:45448->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:45446->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:45486->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:45430->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:45458->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:45470->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:45466->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:45412->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:45500->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:45418->127.0.0.1:50051: use of closed network connection