benchmark/out/grpc_rps_50_n_1.txt

Summary:
  Count:	143
  Total:	10.00 s
  Slowest:	972.38 ms
  Fastest:	254.32 ms
  Average:	690.65 ms
  Requests/sec:	14.31

Response time histogram:
  254.323 [1]  |∎
  326.128 [0]  |
  397.933 [1]  |∎
  469.739 [1]  |∎
  541.544 [1]  |∎
  613.349 [2]  |∎∎
  685.154 [36] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  756.960 [51] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  828.765 [29] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  900.570 [10] |∎∎∎∎∎∎∎∎
  972.376 [1]  |∎

Latency distribution:
  10 % in 638.87 ms 
  25 % in 669.11 ms 
  50 % in 716.37 ms 
  75 % in 763.29 ms 
  90 % in 823.13 ms 
  95 % in 839.79 ms 
  99 % in 873.41 ms 

Status code distribution:
  [OK]            133 responses   
  [Unavailable]   10 responses    

Error distribution:
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:41684->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:41720->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:41722->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:41714->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:41726->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:41796->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:41716->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:41682->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:41718->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:41724->127.0.0.1:50051: use of closed network connection